QQQuer/GD32H7-Openvela/board/contest_board/nuttx/arch/arm/src/gd32h7xx/gd32h7xx_serial.c
#ifdef CONFIG_UART3_RS485
  .rs485_dir_gpio = GPIO_UART3_RS485_DIR,
#  if (CONFIG_UART3_RS485_DIR_POLARITY == 0)
  .rs485_dir_polarity = false,
#  else
  .rs485_dir_polarity = true,
#  endif
#endif
  .lock           = SP_UNLOCKED,
};

static struct uart_dev_s g_uart3port =
{
#if CONSOLE_UART == 3
  .isconsole = true,
#endif
  .recv     =
  {
    .size   = CONFIG_UART3_RXBUFSIZE,
    .buffer = g_uart3rxbuffer,
  },
  .xmit     =
  {
    .size   = sizeof(g_uart3txbuffer),
    .buffer = g_uart3txbuffer,
  },
#if defined(CONFIG_GD32H7_UART3_RXDMA) && defined(CONFIG_GD32H7_UART3_TXDMA)
  .ops      = &g_uart_ops_rxtx_dma,
#elif defined(CONFIG_GD32H7_UART3_RXDMA) && !defined(CONFIG_GD32H7_UART3_TXDMA)
  .ops      = &g_uart_ops_rx_dma,
#elif !defined(CONFIG_GD32H7_UART3_RXDMA) && defined(CONFIG_GD32H7_UART3_TXDMA)
  .ops      = &g_uart_ops_tx_dma,
#else
  .ops      = &g_uart_ops_no_dma,
#endif
  .priv     = &g_uart3priv,
};
#endif

#ifdef CONFIG_GD32H7_UART4_SERIALDRIVER

static struct up_dev_s g_uart4priv =
{
  .usartbase      = GD32_UART4,
  .baud           = CONFIG_UART4_BAUD,
  .clock          = GD32_PCLK1_FREQUENCY,
  .oversamp       = USART_OVSMOD_16,
  .irq            = GD32_IRQ_UART4,
  .parity         = CONFIG_UART4_PARITY,
  .bits           = CONFIG_UART4_BITS,
  .stop_2bits     = CONFIG_UART4_2STOP,

  .tx_gpio        = GPIO_UART4_TX,
  .rx_gpio        = GPIO_UART4_RX,

#if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_UART4_IFLOWCONTROL)
  .iflow          = true,
  .rts_gpio       = GPIO_UART4_RTS,
#endif
#if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_UART4_OFLOWCONTROL)
  .oflow          = true,
  .cts_gpio       = GPIO_UART4_CTS,
#endif
#ifdef CONFIG_GD32H7_UART4_TXDMA
  .txdma_reqid    = DMA_REQUEST_UART4_TX,
#endif
#ifdef CONFIG_GD32H7_UART4_RXDMA
  .rxdma_reqid    = DMA_REQUEST_UART4_RX,
  .rxfifo         = g_uart4rxfifo,
#endif

#ifdef CONFIG_UART4_RS485
  .rs485_dir_gpio = GPIO_UART4_RS485_DIR,
#  if (CONFIG_UART4_RS485_DIR_POLARITY == 0)
  .rs485_dir_polarity = false,
#  else
  .rs485_dir_polarity = true,
#  endif
#endif
  .lock           = SP_UNLOCKED,
};

static struct uart_dev_s g_uart4port =
{
#if CONSOLE_UART == 4
  .isconsole = true,
#endif
  .recv     =
  {
    .size   = CONFIG_UART4_RXBUFSIZE,
    .buffer = g_uart4rxbuffer,
  },
  .xmit     =
  {
    .size   = sizeof(g_uart4txbuffer),
    .buffer = g_uart4txbuffer,
  },
#if defined(CONFIG_GD32H7_UART4_RXDMA) && defined(CONFIG_GD32H7_UART4_TXDMA)
  .ops      = &g_uart_ops_rxtx_dma,
#elif defined(CONFIG_GD32H7_UART4_RXDMA) && !defined(CONFIG_GD32H7_UART4_TXDMA)
  .ops      = &g_uart_ops_rx_dma,
#elif !defined(CONFIG_GD32H7_UART4_RXDMA) && defined(CONFIG_GD32H7_UART4_TXDMA)
  .ops      = &g_uart_ops_tx_dma,
#else
  .ops      = &g_uart_ops_no_dma,
#endif
  .priv     = &g_uart4priv,
};
#endif

#ifdef CONFIG_GD32H7_UART6_SERIALDRIVER

static struct up_dev_s g_uart6priv =
{
  .usartbase      = GD32_UART6,
  .baud           = CONFIG_UART6_BAUD,
  .clock          = GD32_PCLK1_FREQUENCY,
  .oversamp       = USART_OVSMOD_16,
  .irq            = GD32_IRQ_UART6,
  .parity         = CONFIG_UART6_PARITY,
  .bits           = CONFIG_UART6_BITS,
  .stop_2bits     = CONFIG_UART6_2STOP,

  .tx_gpio        = GPIO_UART6_TX,
  .rx_gpio        = GPIO_UART6_RX,

#if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_UART6_IFLOWCONTROL)
  .iflow          = true,
  .rts_gpio       = GPIO_UART6_RTS,
#endif
#if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_UART6_OFLOWCONTROL)
  .oflow          = true,
  .cts_gpio       = GPIO_UART6_CTS,
#endif
#ifdef CONFIG_GD32H7_UART6_TXDMA
  .txdma_reqid    = DMA_REQUEST_UART6_TX,
#endif
#ifdef CONFIG_GD32H7_UART6_RXDMA
  .rxdma_reqid    = DMA_REQUEST_UART6_RX,
  .rxfifo         = g_uart6rxfifo,
#endif

#ifdef CONFIG_UART6_RS485
  .rs485_dir_gpio = GPIO_UART6_RS485_DIR,
#  if (CONFIG_UART6_RS485_DIR_POLARITY == 0)
  .rs485_dir_polarity = false,
#  else
  .rs485_dir_polarity = true,
#  endif
#endif
  .lock           = SP_UNLOCKED,
};

static struct uart_dev_s g_uart6port =
{
#if CONSOLE_UART == 6
  .isconsole = true,
#endif
  .recv     =
  {
    .size   = CONFIG_UART6_RXBUFSIZE,
    .buffer = g_uart6rxbuffer,
  },
  .xmit     =
  {
    .size   = sizeof(g_uart6txbuffer),
    .buffer = g_uart6txbuffer,
  },
#if defined(CONFIG_GD32H7_UART6_RXDMA) && defined(CONFIG_GD32H7_UART6_TXDMA)
  .ops      = &g_uart_ops_rxtx_dma,
#elif defined(CONFIG_GD32H7_UART6_RXDMA) && !defined(CONFIG_GD32H7_UART6_TXDMA)
  .ops      = &g_uart_ops_rx_dma,
#elif !defined(CONFIG_GD32H7_UART6_RXDMA) && defined(CONFIG_GD32H7_UART6_TXDMA)
  .ops      = &g_uart_ops_tx_dma,
#else
  .ops      = &g_uart_ops_no_dma,
#endif
  .priv     = &g_uart6priv,
};
#endif

#ifdef CONFIG_GD32H7_UART7_SERIALDRIVER

static struct up_dev_s g_uart7priv =
{
  .usartbase      = GD32_UART7,
  .baud           = CONFIG_UART7_BAUD,
  .clock          = GD32_PCLK1_FREQUENCY,
  .oversamp       = USART_OVSMOD_16,
  .irq            = GD32_IRQ_UART7,
  .parity         = CONFIG_UART7_PARITY,
  .bits           = CONFIG_UART7_BITS,
  .stop_2bits     = CONFIG_UART7_2STOP,

  .tx_gpio        = GPIO_UART7_TX,
  .rx_gpio        = GPIO_UART7_RX,

#if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_UART7_IFLOWCONTROL)
  .iflow          = true,
  .rts_gpio       = GPIO_UART7_RTS,
#endif
#if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_UART7_OFLOWCONTROL)
  .oflow          = true,
  .cts_gpio       = GPIO_UART7_CTS,
#endif
#ifdef CONFIG_GD32H7_UART7_TXDMA
  .txdma_reqid    = DMA_REQUEST_UART7_TX,
#endif
#ifdef CONFIG_GD32H7_UART7_RXDMA
  .rxdma_reqid    = DMA_REQUEST_UART7_RX,
  .rxfifo         = g_uart7rxfifo,
#endif

#ifdef CONFIG_UART7_RS485
  .rs485_dir_gpio = GPIO_UART7_RS485_DIR,
#  if (CONFIG_UART7_RS485_DIR_POLARITY == 0)
  .rs485_dir_polarity = false,
#  else
  .rs485_dir_polarity = true,
#  endif
#endif
  .lock           = SP_UNLOCKED,
};

static struct uart_dev_s g_uart7port =
{
#if CONSOLE_UART == 7
  .isconsole = true,
#endif
  .recv     =
  {
    .size   = CONFIG_UART7_RXBUFSIZE,
    .buffer = g_uart7rxbuffer,
  },
  .xmit     =
  {
    .size   = sizeof(g_uart7txbuffer),
    .buffer = g_uart7txbuffer,
  },
#if defined(CONFIG_GD32H7_UART7_RXDMA) && defined(CONFIG_GD32H7_UART7_TXDMA)
  .ops      = &g_uart_ops_rxtx_dma,
#elif defined(CONFIG_GD32H7_UART7_RXDMA) && !defined(CONFIG_GD32H7_UART7_TXDMA)
  .ops      = &g_uart_ops_rx_dma,
#elif !defined(CONFIG_GD32H7_UART7_RXDMA) && defined(CONFIG_GD32H7_UART7_TXDMA)
  .ops      = &g_uart_ops_tx_dma,
#else
  .ops      = &g_uart_ops_no_dma,
#endif
  .priv     = &g_uart7priv,
};
#endif

