QQQuer/GD32H7-Openvela/board/contest_board/nuttx/arch/arm/src/gd32h7xx/gd32h7xx_serial.c
/* This table lets us iterate over the configured USARTs */

static struct uart_dev_s * const g_uart_devs[GD32_NUSART] =
{
#ifdef CONFIG_GD32H7_USART0_SERIALDRIVER
  [0] = &g_usart0port,
#endif
#ifdef CONFIG_GD32H7_USART1_SERIALDRIVER
  [1] = &g_usart1port,
#endif
#ifdef CONFIG_GD32H7_USART2_SERIALDRIVER
  [2] = &g_usart2port,
#endif
#ifdef CONFIG_GD32H7_UART3_SERIALDRIVER
  [3] = &g_uart3port,
#endif
#ifdef CONFIG_GD32H7_UART4_SERIALDRIVER
  [4] = &g_uart4port,
#endif
#ifdef CONFIG_GD32H7_USART5_SERIALDRIVER
  [5] = &g_usart5port,
#endif
#ifdef CONFIG_GD32H7_UART6_SERIALDRIVER
  [6] = &g_uart6port,
#endif
#ifdef CONFIG_GD32H7_UART7_SERIALDRIVER
  [7] = &g_uart7port,
#endif
};

#ifdef CONFIG_PM
static  struct pm_callback_s g_serial_pmcb =
{
  .notify  = up_pm_notify,
  .prepare = up_pm_prepare,
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: up_serialin
 ****************************************************************************/

static inline uint32_t up_serialin(struct up_dev_s *priv, int offset)
{
  return getreg32(priv->usartbase + offset);
}

/****************************************************************************
 * Name: up_serialout
 ****************************************************************************/

static inline void up_serialout(struct up_dev_s *priv, int offset,
                                uint32_t value)
{
  putreg32(value, priv->usartbase + offset);
}

/****************************************************************************
 * Name: up_setusartint
 ****************************************************************************/

static void up_setusartint(struct up_dev_s *priv, uint32_t ie)
{
  uint32_t regval;

  /* Save the interrupt mask */

  priv->ie = ie;

  /* Set the interrupt bits in the USART control registers */

  regval = up_serialin(priv, GD32_USART_CTL0_OFFSET);
  regval &= ~(USART_CTL0_USED_INTS);
  regval |= (ie & USART_CTL0_USED_INTS);
  up_serialout(priv, GD32_USART_CTL0_OFFSET, regval);

  /* regval = up_serialin(priv, GD32_USART_CTL1_OFFSET);
   * regval |= (ie & USART_CTL1_USED_INTS);
   * up_serialout(priv, GD32_USART_CTL1_OFFSET, regval);
   */

  regval = up_serialin(priv, GD32_USART_CTL2_OFFSET);
  regval &= ~(USART_CTL2_USED_INTS);
  regval |= (ie & USART_CTL2_USED_INTS);
  up_serialout(priv, GD32_USART_CTL2_OFFSET, regval);
}

/****************************************************************************
 * Name: up_disableusartint
 ****************************************************************************/

static void up_disableusartint(struct up_dev_s *priv, uint32_t *ie)
{
  irqstate_t flags;
  uint32_t regval;

  flags = spin_lock_irqsave(&priv->lock);

  if (ie)
    {
      /* Return the current interrupt mask value for the USART */

      regval  = up_serialin(priv, GD32_USART_CTL0_OFFSET);
      regval &= USART_CTL0_INT_MASK;
      *ie     = regval;

      /* regval  = up_serialin(priv, GD32_USART_CTL1_OFFSET);
       * regval &= USART_CTL1_INT_MASK;
       *  *ie    |= regval;
       */

      regval  = up_serialin(priv, GD32_USART_CTL2_OFFSET);
      regval &= USART_CTL2_INT_MASK;
      *ie    |= regval;
    }

  /* Disable all interrupts */

  regval = up_serialin(priv, GD32_USART_CTL0_OFFSET);
  regval &= ~USART_CTL0_INT_MASK;
  up_serialout(priv, GD32_USART_CTL0_OFFSET, regval);

  regval = up_serialin(priv, GD32_USART_CTL1_OFFSET);
  regval &= ~USART_CTL1_INT_MASK;
  up_serialout(priv, GD32_USART_CTL1_OFFSET, regval);

  regval = up_serialin(priv, GD32_USART_CTL2_OFFSET);
  regval &= ~USART_CTL2_INT_MASK;
  up_serialout(priv, GD32_USART_CTL2_OFFSET, regval);

  spin_unlock_irqrestore(&priv->lock, flags);
}

/****************************************************************************
 * Name: up_restoreusartint
 ****************************************************************************/

static void up_restoreusartint(struct up_dev_s *priv, uint32_t ie)
{
  irqstate_t flags;

  flags = spin_lock_irqsave(&priv->lock);
  up_setusartint(priv, ie);
  spin_unlock_irqrestore(&priv->lock, flags);
}

/****************************************************************************
 * Name: up_dma_nextrx
 *
 * Description:
 *   Returns the index into the RX FIFO where the DMA will place the next
 *   byte that it receives.
 *
 ****************************************************************************/

#ifdef SERIAL_HAVE_RXDMA
static int up_dma_nextrx(struct up_dev_s *priv)
{
  size_t dmaresidual;

  dmaresidual = gd32_dma_residual(priv->rxdma);

  return (RXDMA_BUFFER_SIZE - (int)dmaresidual) % RXDMA_BUFFER_SIZE;
}
#endif

/****************************************************************************
 * Name: gd32_usart_configure
 *
 * Description:
 *   Configure a UART for non-DMA operation.
 *
 ****************************************************************************/

#ifndef CONFIG_SUPPRESS_UART_CONFIG
static void gd32_usart_configure(struct uart_dev_s *dev)
{
  struct up_dev_s *priv = (struct up_dev_s *)dev->priv;
  uint32_t udiv;
  uint32_t intdiv;
  uint32_t fradiv;
  uint32_t regval;

  /* Configure the USART oversample mode. */

  regval = up_serialin(priv, GD32_USART_CTL0_OFFSET);
  regval &= ~(USART_CTL0_OVSMOD);
  regval |= priv->oversamp;
  up_serialout(priv, GD32_USART_CTL0_OFFSET, regval);

  /* Configure USART baud rate value */

  if ((priv->oversamp & USART_CTL0_OVSMOD) == USART_OVSMOD_8)
    {
      /* When oversampling by 8, configure the value of USART_BAUD */

      udiv = ((priv->clock * 2) + priv->baud / 2) / priv->baud;
      intdiv = udiv & 0xfff0;
      fradiv = (udiv >> 1) & 0x7u;
    }
  else
    {
      /* When oversampling by 16, configure the value of USART_BAUD */

      udiv = (priv->clock + priv->baud / 2) / priv->baud;
      intdiv = udiv & 0xfff0;
      fradiv = udiv & 0xf;
    }

  regval = ((USART_BAUD_FRADIV_MASK | USART_BAUD_INTDIV_MASK) &
            (intdiv | fradiv));
  up_serialout(priv, GD32_USART_BAUD_OFFSET, regval);

