QQQuer/GD32H7-Openvela/board/contest_board/nuttx/arch/arm/src/gd32h7xx/gd32h7xx_serial.c
  /* Configure parity and data bits */

  regval = up_serialin(priv, GD32_USART_CTL0_OFFSET);
  regval &= ~(USART_CTL0_PM_MASK | USART_CTL0_WL0 | USART_CTL0_WL1);

  if (priv->parity == 1)       /* Odd parity */
    {
      regval |= USART_CTL0_PM_ODD;
    }
  else if (priv->parity == 2)  /* Even parity */
    {
      regval |= USART_CTL0_PM_EVEN;
    }

  /* Configure USART word length */

  if (priv->bits == 9 || (priv->bits == 8 && priv->parity != 0))
    {
      regval |= USART_WL_9BIT;  /* 9 bits */
    }
  else if (priv->bits == 7)
    {
      regval |= USART_WL_7BIT;  /* 7 bits */
    }
  else
    {
      regval |= USART_WL_8BIT;  /* 8 bits */
    }

  up_serialout(priv, GD32_USART_CTL0_OFFSET, regval);

  /* Configure STOP bits */

  regval = up_serialin(priv, GD32_USART_CTL1_OFFSET);
  regval &= ~(USART_CTL1_STB_MASK);

  if (priv->stop_2bits)
    {
      regval |= USART_CTL1_STB2BIT;
    }

  up_serialout(priv, GD32_USART_CTL1_OFFSET, regval);

  /* Configure hardware flow control */

  regval  = up_serialin(priv, GD32_USART_CTL2_OFFSET);
  regval &= ~(USART_CTL2_RTSEN | USART_CTL2_CTSEN);

#if defined(CONFIG_SERIAL_IFLOWCONTROL) && \
  !defined(CONFIG_GD32H7_FLOWCONTROL_BROKEN)
  if (priv->iflow && (priv->rts_gpio != 0))
    {
      regval |= USART_CTL2_RTSEN;
    }
#endif

#ifdef CONFIG_SERIAL_OFLOWCONTROL
  if (priv->oflow && (priv->cts_gpio != 0))
    {
      regval |= USART_CTL2_CTSEN;
    }
#endif

  up_serialout(priv, GD32_USART_CTL2_OFFSET, regval);
}
#endif

/****************************************************************************
 * Name: up_setup
 *
 * Description:
 *   Configure the USART baud, bits, parity, etc. This method is called the
 *   first time that the serial port is opened.
 *
 ****************************************************************************/

static int up_setup(struct uart_dev_s *dev)
{
  struct up_dev_s *priv = (struct up_dev_s *)dev->priv;

#ifndef CONFIG_SUPPRESS_UART_CONFIG
  uint32_t regval;

  /* Enable USART clock */

  gd32_usart_clock_enable(priv->usartbase);

  /* Configure pins for USART use */

  gd32_gpio_config(priv->tx_gpio);
  gd32_gpio_config(priv->rx_gpio);

#ifdef CONFIG_SERIAL_IFLOWCONTROL
  if (priv->rts_gpio != 0)
    {
      uint32_t config = priv->rts_gpio;

#ifdef CONFIG_GD32H7_FLOWCONTROL_BROKEN
      /* Instead of letting hardware manage this pin, we will bitbang */

      config = (config & ~GPIO_CFG_MODE_MASK) | GPIO_CFG_OUTPUT;
#endif
      gd32_gpio_config(config);
    }
#endif

#ifdef CONFIG_SERIAL_OFLOWCONTROL
  if (priv->cts_gpio != 0)
    {
      gd32_gpio_config(priv->cts_gpio);
    }
#endif

#ifdef HAVE_RS485
  if (priv->rs485_dir_gpio != 0)
    {
      gd32_gpio_config(priv->rs485_dir_gpio);
      gd32_gpio_write(priv->rs485_dir_gpio, !priv->rs485_dir_polarity);
    }
#endif

  /* Disable USART */

  regval = up_serialin(priv, GD32_USART_CTL0_OFFSET);
  regval &= ~(USART_CTL0_UEN);
  up_serialout(priv, GD32_USART_CTL0_OFFSET, regval);

  /* Configure the USART. */

  gd32_usart_configure(dev);

  /* Enable USART receiver and transmmiter */

  regval = up_serialin(priv, GD32_USART_CTL0_OFFSET);
  regval |= (USART_CTL0_UEN | USART_CTL0_REN | USART_CTL0_TEN);
  up_serialout(priv, GD32_USART_CTL0_OFFSET, regval);

#endif /* CONFIG_SUPPRESS_UART_CONFIG */

  /* Set up the cached interrupt enables value */

  priv->ie    = 0;

  /* Set initialize state. */

  priv->initialized = true;

  return OK;
}

/****************************************************************************
 * Name: up_dma_setup
 *
 * Description:
 *   Configure the USART baud, bits, parity, etc. This method is called the
 *   first time that the serial port is opened.
 *
 ****************************************************************************/

#if defined(SERIAL_HAVE_RXDMA) || defined(SERIAL_HAVE_TXDMA)
static int up_dma_setup(struct uart_dev_s *dev)
{
  struct up_dev_s *priv = (struct up_dev_s *)dev->priv;
  int result;

  /* Do the basic UART setup first, unless we are the console */

  if (!dev->isconsole)
    {
      result = up_setup(dev);
      if (result != OK)
        {
          return result;
        }
    }

#if defined(SERIAL_HAVE_TXDMA)
  /* Acquire the Tx DMA channel.  This should always succeed. */

  if (priv->txdma_reqid != 0)
    {
      priv->txdma = gd32_dma_channel_alloc(priv->txdma_reqid);
      if (priv->txdma == NULL)
        {
          return -EBUSY;
        }

      /* NOTE: Do NOT enable DENT here. DENT will be toggled in
       * up_dma_send() to properly trigger DMA requests on H7.
       */
    }
#endif

#if defined(SERIAL_HAVE_RXDMA)
  /* Acquire the DMA channel.  This should always succeed. */

  if (priv->rxdma_reqid != 0)
    {
      struct gd32_dma_config_s dma_config;

      priv->rxdma = gd32_dma_channel_alloc(priv->rxdma_reqid);
      if (priv->rxdma == NULL)
        {
#if defined(SERIAL_HAVE_TXDMA)
          /* Free TX channel if RX allocation failed */

          if (priv->txdma != NULL)
            {
              gd32_dma_channel_free(priv->txdma);
              priv->txdma = NULL;
            }
#endif

          return -EBUSY;
        }

      dma_config.direction    = DMA_PERIPH_TO_MEMORY;
      dma_config.memory_addr  = (uint32_t)priv->rxfifo;
      dma_config.number       = RXDMA_BUFFER_SIZE;
      dma_config.periph_addr  = priv->usartbase +
                                GD32_USART_RDATA_OFFSET;
      dma_config.periph_width = DMA_PERIPH_WIDTH_8BIT;
      dma_config.memory_width = DMA_MEMORY_WIDTH_8BIT;
      dma_config.periph_inc   = false;
      dma_config.memory_inc   = true;
      dma_config.priority     = USART_DMA_PRIO;
      dma_config.circular     = true;

      /* Configure for circular DMA reception into the RX fifo */

      gd32_dma_setup(priv->rxdma, &dma_config);

      /* Reset our DMA shadow pointer and Rx data availability count
       * to match the address just programmed above.
       */

      priv->rxdmanext = 0;
#ifdef CONFIG_ARMV7M_DCACHE
      priv->rxdmaavail = 0;
#endif

