QQQuer/GD32H7-Openvela/board/contest_board/nuttx/arch/arm/src/gd32h7xx/gd32h7xx_serial.c
      /* Start the DMA channel FIRST, then enable USART DMA
       * (per GD32 official demo sequence)
       * Enable half-transfer and full-transfer interrupts for circular mode
       */

      gd32_dma_start(priv->rxdma, up_dma_rx_callback, (void *)dev,
                     DMA_CHXCTL_HTFIE | DMA_CHXCTL_FTFIE);

      /* Enable receive Rx DMA for the UART */

      modifyreg32(priv->usartbase + GD32_USART_CTL2_OFFSET,
                  0, USART_CTL2_DENR);
    }
#endif

  priv->initialized = true;

  return OK;
}
#endif

/****************************************************************************
 * Name: up_shutdown
 *
 * Description:
 *   Disable the USART.  This method is called when the serial
 *   port is closed
 *
 ****************************************************************************/

static void up_shutdown(struct uart_dev_s *dev)
{
  struct up_dev_s *priv = (struct up_dev_s *)dev->priv;

  /* Reset initialize state. */

  priv->initialized = false;

  /* Reset hardware and disable Rx and Tx */

  gd32_usart_reset(priv->usartbase);

  /* Disable USART clock */

  gd32_usart_clock_disable(priv->usartbase);

  /* Unconfigure RX, TX GPIO */

  gd32_gpio_unconfig(priv->tx_gpio);
  gd32_gpio_unconfig(priv->rx_gpio);

#ifdef CONFIG_SERIAL_OFLOWCONTROL
  if (priv->cts_gpio != 0)
    {
      gd32_gpio_unconfig(priv->cts_gpio);
    }
#endif

#ifdef CONFIG_SERIAL_IFLOWCONTROL
  if (priv->rts_gpio != 0)
    {
      gd32_gpio_unconfig(priv->rts_gpio);
    }
#endif

#ifdef HAVE_RS485
  if (priv->rs485_dir_gpio != 0)
    {
      gd32_gpio_unconfig(priv->rs485_dir_gpio);
    }
#endif
}

/****************************************************************************
 * Name: up_dma_shutdown
 *
 * Description:
 *   Disable the USART.  This method is called when the serial
 *   port is closed
 *
 ****************************************************************************/

#if defined(SERIAL_HAVE_RXDMA) || defined(SERIAL_HAVE_TXDMA)
static void up_dma_shutdown(struct uart_dev_s *dev)
{
  struct up_dev_s *priv = (struct up_dev_s *)dev->priv;

  /* Disable USART DMA requests first */

  modifyreg32(priv->usartbase + GD32_USART_CTL2_OFFSET,
              USART_CTL2_DENR | USART_CTL2_DENT, 0);

#ifdef SERIAL_HAVE_RXDMA
  if (priv->rxdma != NULL)
    {
      gd32_dma_stop(priv->rxdma);
      gd32_dma_channel_free(priv->rxdma);
      priv->rxdma = NULL;
    }
#endif

#ifdef SERIAL_HAVE_TXDMA
  if (priv->txdma != NULL)
    {
      gd32_dma_stop(priv->txdma);
      gd32_dma_channel_free(priv->txdma);
      priv->txdma = NULL;

      dev->dmatx.length = 0;
      dev->dmatx.nlength = 0;
    }
#endif

  /* Perform the normal UART shutdown after DMA is quiesced */

  up_shutdown(dev);
}
#endif

/****************************************************************************
 * Name: up_attach
 *
 * Description:
 *   Configure the USART to operation in interrupt driven mode.  This method
 *   is called when the serial port is opened.  Normally, this is just after
 *   the setup() method is called, however, the serial console may operate in
 *   a non-interrupt driven mode during the boot phase.
 *
 *   RX and TX interrupts are not enabled when by the attach method (unless
 *   the hardware supports multiple levels of interrupt enabling).
 *   The RX and TX interrupts are not enabled until the txint() and rxint()
 *   methods are called.
 *
 ****************************************************************************/

static int up_attach(struct uart_dev_s *dev)
{
  struct up_dev_s *priv = (struct up_dev_s *)dev->priv;
  int ret;

  /* Attach and enable the IRQ */

  ret = irq_attach(priv->irq, up_interrupt, dev);
  if (ret == OK)
    {
      /* Enable the interrupt (RX and TX interrupts are still disabled
       * in the USART
       */

      up_enable_irq(priv->irq);
    }

  return ret;
}

/****************************************************************************
 * Name: up_detach
 *
 * Description:
 *   Detach USART interrupts.  This method is called when the serial port is
 *   closed normally just before the shutdown method is called. The exception
 *   is the serial console which is never shutdown.
 *
 ****************************************************************************/

static void up_detach(struct uart_dev_s *dev)
{
  struct up_dev_s *priv = (struct up_dev_s *)dev->priv;
  up_disable_irq(priv->irq);
  irq_detach(priv->irq);
}

/****************************************************************************
 * Name: up_interrupt
 *
 * Description:
 *   This is the USART interrupt handler.  It will be invoked when an
 *   interrupt received on the 'irq'  It should call uart_transmitchars or
 *   uart_receivechar to perform the appropriate data transfers.  The
 *   interrupt handling logic must be able to map the 'irq' number into the
 *   appropriate uart_dev_s structure in order to call these functions.
 *
 ****************************************************************************/

static int up_interrupt(int irq, void *context, void *arg)
{
  struct uart_dev_s *dev = (struct uart_dev_s *)arg;
  struct up_dev_s   *priv;
  int  passes;
  bool handled;

  DEBUGASSERT(dev != NULL && dev->priv != NULL);
  priv = (struct up_dev_s *)dev->priv;

#if defined(CONFIG_PM) && CONFIG_GD32H7_PM_SERIAL_ACTIVITY > 0
  /* Report serial activity to the power management logic */

  pm_activity(PM_IDLE_DOMAIN, CONFIG_GD32H7_PM_SERIAL_ACTIVITY);
#endif

  /* Loop until there are no characters to be transferred or,
   * until we have been looping for a long time.
   */

  handled = true;
  for (passes = 0; passes < 256 && handled; passes++)
    {
      handled = false;

      /* Get the current USART status. */

      priv->sr = up_serialin(priv, GD32_USART_STAT_OFFSET);

#ifdef HAVE_RS485
      /* Transmission is complete. */

      if (((priv->sr & USART_STAT_TC) != 0) &&
          ((priv->ie & USART_CTL0_TCIE) ==
            USART_CTL0_TCIE) &&
          ((priv->ie & USART_CTL0_TBEIE) !=
            USART_CTL0_TBEIE))
        {
          gd32_gpio_write(priv->rs485_dir_gpio, !priv->rs485_dir_polarity);
          priv->ie &= ~USART_CTL0_TCIE;
          up_restoreusartint(priv, priv->ie);
        }
#endif

      /* Handle incoming, receive bytes. */

      if (((priv->sr & USART_STAT_RBNE) != 0) &&
          ((priv->ie & USART_CTL0_RBNEIE) ==
            USART_CTL0_RBNEIE))
        {
          uart_recvchars(dev);
          handled = true;
        }

