QQQuer/GD32H7-Openvela/board/contest_board/nuttx/arch/arm/src/gd32h7xx/gd32h7xx_serial.c
#ifdef SERIAL_HAVE_TXDMA
static void up_dma_txavailable(struct uart_dev_s *dev)
{
  struct up_dev_s *priv = (struct up_dev_s *)dev->priv;
  irqstate_t flags;

  flags = enter_critical_section();

  /* Only send when the DMA is idle */

  if (dev->dmatx.length == 0 &&
      dev->dmatx.nlength == 0 &&
      gd32_dma_transnum_get(priv->txdma) == 0)
    {
      uart_xmitchars_dma(dev);
    }

  leave_critical_section(flags);
}
#endif

/****************************************************************************
 * Name: up_dma_send
 *
 * Description:
 *   Called (usually) from the interrupt level to start DMA transfer.
 *   (Re-)Configures DMA Stream updating buffer and buffer length.
 *
 ****************************************************************************/

#ifdef SERIAL_HAVE_TXDMA
static void up_dma_send(struct uart_dev_s *dev)
{
  struct up_dev_s *priv = (struct up_dev_s *)dev->priv;

  /* Disable DENT and stop DMA before reconfiguration */

  modifyreg32(priv->usartbase + GD32_USART_CTL2_OFFSET, USART_CTL2_DENT, 0);
  gd32_dma_stop(priv->txdma);

  dev->dmatx.nbytes = 0;

  struct gd32_dma_config_s dma_config;

  dma_config.direction    = DMA_MEMORY_TO_PERIPH;
  dma_config.memory_addr  = (uint32_t)dev->dmatx.buffer;
  dma_config.number       = dev->dmatx.length;
  dma_config.periph_addr  = priv->usartbase +
                            GD32_USART_TDATA_OFFSET;
  dma_config.periph_width = DMA_PERIPH_WIDTH_8BIT;
  dma_config.memory_width = DMA_MEMORY_WIDTH_8BIT;
  dma_config.periph_inc   = false;
  dma_config.memory_inc   = true;
  dma_config.priority     = USART_DMA_PRIO;
  dma_config.circular     = false;

#ifdef CONFIG_ARMV7M_DCACHE
  up_clean_dcache((uintptr_t)dev->dmatx.buffer,
                  (uintptr_t)dev->dmatx.buffer + dev->dmatx.length);
#endif

  gd32_dma_setup(priv->txdma, &dma_config);

  /* Clear TC flag before starting DMA (per user manual 25.3.5) */

  up_serialout(priv, GD32_USART_INTC_OFFSET, USART_INTC_TCC);

  /* Start DMA channel, then enable DENT (per official demo sequence) */

  gd32_dma_start(priv->txdma, up_dma_tx_callback,
                 (void *)dev, USART_TXDMA_INTEN);
  modifyreg32(priv->usartbase + GD32_USART_CTL2_OFFSET, 0, USART_CTL2_DENT);

  /* Match the stable GD32 family DMA TX flow: do not return until the
   * USART transmitter reports completion for the current DMA submission.
   */

  while (up_txempty(dev) == 0)
    {
    }
}
#endif

/****************************************************************************
 * Name: up_send
 *
 * Description:
 *   This method will send one byte on the USART
 *
 ****************************************************************************/

static void up_send(struct uart_dev_s *dev, int ch)
{
  struct up_dev_s *priv = (struct up_dev_s *)dev->priv;
#ifdef HAVE_RS485
  if (priv->rs485_dir_gpio != 0)
    {
      gd32_gpio_write(priv->rs485_dir_gpio, priv->rs485_dir_polarity);
    }
#endif

  up_serialout(priv, GD32_USART_TDATA_OFFSET,
               (uint32_t)(ch & USART_DATA_MASK));
}

/****************************************************************************
 * Name: up_dma_txint
 *
 * Description:
 *   Call to enable or disable TX interrupts from the UART.
 *
 ****************************************************************************/

#ifdef SERIAL_HAVE_TXDMA
static void up_dma_txint(struct uart_dev_s *dev, bool enable)
{
  /* Nothing to do. */
}
#endif

/****************************************************************************
 * Name: up_txint
 *
 * Description:
 *   Call to enable or disable TX interrupts
 *
 ****************************************************************************/

#if defined(SERIAL_HAVE_RX_DMA) || defined(SERIAL_NOT_HAVE_DMA) || \
  defined(CONFIG_GD32H7_SERIALBRK_BSDCOMPAT)
static void up_txint(struct uart_dev_s *dev, bool enable)
{
  struct up_dev_s *priv = (struct up_dev_s *)dev->priv;
  irqstate_t flags;

  flags = enter_critical_section();
  if (enable)
    {
      /* Enable the TX interrupt */

#ifndef CONFIG_SUPPRESS_SERIAL_INTS
      uint32_t ie = priv->ie | USART_CTL0_TBEIE;

      /* If RS-485 is supported on this USART, also enable the TCIE */

#  ifdef HAVE_RS485
      if (priv->rs485_dir_gpio != 0)
        {
          ie |= USART_CTL0_TCIE;
        }
#  endif

      up_setusartint(priv, ie);

#else
      /* Fake a TX interrupt here by just calling uart_xmitchars() with
       * interrupts disabled (note this may recurse).
       */

      uart_xmitchars(dev);
#endif
    }
  else
    {
      /* Disable the TX interrupt */

      priv->ie &= ~USART_CTL0_TBEIE;
      up_setusartint(priv, priv->ie);
    }

  leave_critical_section(flags);
}
#endif

/****************************************************************************
 * Name: up_txready
 *
 * Description:
 *   Return true if the tranmsit data register is empty
 *
 ****************************************************************************/

static bool up_txready(struct uart_dev_s *dev)
{
  struct up_dev_s *priv = (struct up_dev_s *)dev->priv;
  return ((up_serialin(priv, GD32_USART_STAT_OFFSET) &
           USART_STAT_TBE) != 0);
}

/****************************************************************************
 * Name: up_txempty
 *
 * Description:
 *   Return true if the transmit data register is empty
 *
 ****************************************************************************/

static bool up_txempty(struct uart_dev_s *dev)
{
  struct up_dev_s *priv = (struct up_dev_s *)dev->priv;
  return ((up_serialin(priv, GD32_USART_STAT_OFFSET) &
           USART_STAT_TC) != 0);
}

/****************************************************************************
 * Name: up_dma_rx_callback
 *
 * Description:
 *   This function checks the current DMA state and calls the generic
 *   serial stack when bytes appear to be available.
 *
 ****************************************************************************/

#ifdef SERIAL_HAVE_RXDMA
static void up_dma_rx_callback(DMA_HANDLE handle, uint16_t status, void *arg)
{
  struct uart_dev_s *dev = (struct uart_dev_s *)arg;
  struct up_dev_s *priv = (struct up_dev_s *)dev->priv;

  if (priv->rxenable && up_dma_rxavailable(dev))
    {
      uart_recvchars(dev);
    }
}
#endif

/****************************************************************************
 * Name: up_pm_notify
 *
 * Description:
 *   Notify the driver of new power state. This callback is  called after
 *   all drivers have had the opportunity to prepare for the new power state.
 *
 * Input Parameters:
 *
 *    cb - Returned to the driver. The driver version of the callback
 *         structure may include additional, driver-specific state data at
 *         the end of the structure.
 *
 *    pmstate - Identifies the new PM state
 *
 * Returned Value:
 *   None - The driver already agreed to transition to the low power
 *   consumption state when when it returned OK to the prepare() call.
 *
 *
 ****************************************************************************/

